[
  {
    "title": "Batchify - An AI Product Shot Generator",
    "subtitle": "Transform your product photos into high-end studio shots at scale",
    "description": "Batchify leverages the advanced multimodal capabilities of Gemini 2.5 Flash Image Preview (\"Nano-Banana\") as its core engine. The app transforms standard product photos into high-end marketing assets by allowing users to describe a desired background, upload a reference image or let the AI decide for them. Key features include 'Apply to All' for batch consistency, using Nano-Banana's powerful style transfer to apply the same background, lighting, and professional aesthetic across an entire batch of product photos. Smart Background Suggestions analyze uploaded product photos and automatically suggest creative background prompts that complement the product. Batchify is a complete pipeline, from ideation to scalable production, helping e-commerce sellers create studio-quality, customized visuals without the traditional time, cost, or technical know-how.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/batchify-an-ai-product-shot-generator"
  },
  {
    "title": "AI Comic Creator",
    "subtitle": "Creating comics is traditionally a time-consuming and labor-intensive process, with character consistency",
    "description": "Creating comics is traditionally a time-consuming and labor-intensive process, with character consistency across multiple panels being one of the most challenging tasks. Our project, AI Comic Creator, solves this issue by leveraging the advanced features of Gemini 2.5 Flash Image (Nano Banana). The system maintains character consistency across multiple panels, making comic creation more accessible and efficient for creators.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/ai-comic-creator"
  },
  {
    "title": "Red Star Realism",
    "subtitle": "Generative AI Propaganda",
    "description": "A project exploring generative AI for creating propaganda-style visuals with realistic rendering capabilities.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/red-star-realism"
  },
  {
    "title": "Style Forge",
    "subtitle": "Nano Banana powered virtual try-on",
    "description": "A virtual try-on application powered by Nano Banana technology, allowing users to experiment with different styles and clothing options through AI-generated visualizations.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/style-forge"
  },
  {
    "title": "WorldDress AI",
    "subtitle": "Instantly experience traditional costumes worldwide",
    "description": "Experience global traditions with a single photo. Pick a country and let our AI transform you in seconds, allowing users to virtually wear traditional costumes from around the world using advanced AI image generation.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/worlddress-ai"
  },
  {
    "title": "AI Immersive Chatbot (AI Friends)",
    "subtitle": "Immersive AI conversation with consistent visual identity",
    "description": "An AI chatbot with consistent image and voice for immersive, lifelike conversation using Gemini 2.5 Flash Image, creating a more engaging and personal AI interaction experience.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/ai-immersive-chatbot-ai-friends"
  },
  {
    "title": "Improved Video Editing Elements Using Nano Banana",
    "subtitle": "Visual Enhancing with Nano Banana",
    "description": "A video editing enhancement tool that uses Nano Banana technology to improve visual elements in video content, providing advanced editing capabilities for content creators.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/improved-video-editing-elements-using-nano-banana"
  },
  {
    "title": "AtelierOne: AI Renaissance Portrait Generator",
    "subtitle": "Transform your webcam photos into Renaissance masterpieces",
    "description": "Transform your webcam photos into Renaissance masterpieces while learning art history through an interactive timeline experience. This tool combines AI image generation with educational content about Renaissance art and techniques.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/atelierone-ai-renaissance-portrait-generator"
  },
  {
    "title": "AI Recipe Generator",
    "subtitle": "Automatic recipe generation with visual output",
    "description": "An AI Recipe Generator web application that automatically generates recipe instructions and completed dish images based on user input, making cooking more accessible and visual.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/ai-recipe-generator"
  },
  {
    "title": "From Awkward Poses to Instagram Worthy – Building My Own AI Photo App",
    "subtitle": "AI-powered photo pose and background improvement",
    "description": "A project where I built an AI-powered app to help people improve their photo poses and backgrounds effortlessly using Google's Nano Banana technology, transforming amateur photos into professional-looking images.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/from-awkward-poses-to-instagram-worthy-building-my"
  },
  {
    "title": "Batchify - An AI Product Shot Generator",
    "subtitle": "Transform your product photos into high-end studio shots at scale",
    "description": "Transform your product photos into high-end studio shots at scale",
    "url": "https://www.kaggle.com/competitions/banana/writeups/batchify---an-ai-product-shot-generator"
  },
  {
    "title": "WorldDress AI – Instantly experience traditional costumes worldwide",
    "subtitle": "Experience global traditions with a single photo. Pick a country and let our AI transform you in sec...",
    "description": "Experience global traditions with a single photo. Pick a country and let our AI transform you in seconds.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/worlddress-ai-instantly-experience-traditional-costumes-worldwide"
  },
  {
    "title": "From Awkward Poses to Instagram Worthy – Building My Own AI Photo App",
    "subtitle": "A project where I built an AI-powered app to help people improve their photo poses and backgrounds e...",
    "description": "A project where I built an AI-powered app to help people improve their photo poses and backgrounds effortlessly using Google's Nano Banana",
    "url": "https://www.kaggle.com/competitions/banana/writeups/from-awkward-poses-to-instagram-worthy-building-my-own-ai-photo-app"
  },
  {
    "title": "AI Mockup Pro - R.I.P Figma",
    "subtitle": "An AI design tool that turns wireframes into high-fidelity mockups and code in seconds using Nano Ba...",
    "description": "An AI design tool that turns wireframes into high-fidelity mockups and code in seconds using Nano Banana.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/ai-mockup-pro---rip-figma"
  },
  {
    "title": "PoseUp.ai: Instantly Change Your Pose with Natural Language & AI",
    "subtitle": "An AI photo editor built on Gemini that lets you change a person's entire body pose using simple tex...",
    "description": "An AI photo editor built on Gemini that lets you change a person's entire body pose using simple text commands or one-click templates.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/poseupai-instantly-change-your-pose-with-natural-language-ai"
  },
  {
    "title": "AI Comic Factory",
    "subtitle": "Generate multi-page comics from a simple prompt. Provide character and style references to create yo...",
    "description": "Generate multi-page comics from a simple prompt. Provide character and style references to create your unique story with AI.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/ai-comic-factory"
  },
  {
    "title": "Celebrity Selfie Generator",
    "subtitle": "Upload your photo and generate a realistic selfie with up to two famous personalities from history a...",
    "description": "Upload your photo and generate a realistic selfie with up to two famous personalities from history and today.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/celebrity-selfie-generator"
  },
  {
    "title": "AI Creative Dice – Structured Randomness for Creative Innovation",
    "subtitle": "AI Creative Dice is your pocket-sized idea machine. Just upload then roll the dice and boom, ads con...",
    "description": "AI Creative Dice is your pocket-sized idea machine. Just upload then roll the dice and boom, ads concepts land right in front of you.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/ai-creative-dice-structured-randomness-for-creative-innovation"
  },
  {
    "title": "Expression Deck",
    "subtitle": "A card deck of emotions",
    "description": "A card deck of emotions",
    "url": "https://www.kaggle.com/competitions/banana/writeups/expression-deck"
  },
  {
    "title": "ProcessViz AI: Multi-Style Industrial Process Diagram Generator",
    "subtitle": "Transforming complex industrial processes into CAD-quality diagrams, educational schematics, and pho...",
    "description": "Transforming complex industrial processes into CAD-quality diagrams, educational schematics, and photorealistic 3D renders",
    "url": "https://www.kaggle.com/competitions/banana/writeups/processviz-ai-multi-style-industrial-process-diagram-generator"
  },
  {
    "title": "Who Were You in Ancient Times?",
    "subtitle": "invites users to discover their historical alter egos. After uploading a selfie, the app uses Nano B...",
    "description": "invites users to discover their historical alter egos. After uploading a selfie, the app uses Nano Banana's character-consistency engine to",
    "url": "https://www.kaggle.com/competitions/banana/writeups/who-were-you-in-ancient-times"
  },
  {
    "title": "VisuaLink- Instant Marketing Posters with Gemini",
    "subtitle": "Visualink is a lightweight web app that generates professional-quality marketing posters in seconds.",
    "description": "Visualink is a lightweight web app that generates professional-quality marketing posters in seconds.",
    "url": "https://www.kaggle.com/competitions/banana/writeups/visualink--instant-marketing-posters-with-gemini"
  },
  {
    "title": "Revolutionizing Ad Design with AI: Introducing AI-Ad-Creator",
    "subtitle": "An AI powered digital Ad Creator",
    "description": "An AI powered digital Ad Creator",
    "url": "https://www.kaggle.com/competitions/banana/writeups/revolutionizing-ad-design-with-ai-introducing-ai-ad-creator"
  }
]